; ModuleID = 'src/spmv_csr.cpp'
source_filename = "src/spmv_csr.cpp"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.COO = type { i32, i32, double }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@cache_flush = dso_local local_unnamed_addr global [65536 x double] zeroinitializer, align 8, !dbg !0
@row = dso_local global i32 0, align 4, !dbg !76
@col = dso_local global i32 0, align 4, !dbg !78
@nnz = dso_local global i32 0, align 4, !dbg !80
@mat = dso_local global [10000000 x %struct.COO] zeroinitializer, align 8, !dbg !82
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"\E6\96\87\E4\BB\B6\E8\B7\AF\E5\BE\84\E4\B8\BA\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"%d%d%d\00", align 1
@.str.6 = private unnamed_addr constant [68 x i8] c"\E7\A8\80\E7\96\8F\E7\9F\A9\E9\98\B5\E4\B8\AD\EF\BC\8C\E8\A1\8C\E6\95\B0\E4\B8\BA%d\EF\BC\8C\E5\88\97\E6\95\B0\E4\B8\BA%d\EF\BC\8C\E9\9D\9E\E9\9B\B6\E5\85\83\E7\B4\A0\E5\85\B1\E6\9C\89%d\0A\00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"%d%d%lf\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c"true\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cache_flush", scope: !2, file: !3, line: 15, type: !100, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 10.0.1-++20211003084855+ef32c611aa21-1~exp1~20211003085243.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !75, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/spmv_csr.cpp", directory: "/home/fugelin/Work/Research/gem5/prefetch_project/sam_swpf/program/spmv")
!4 = !{}
!5 = !{!6, !8, !10, !69, !73, !74}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!10 = !DISubprogram(name: "fclose", scope: !11, file: !11, line: 199, type: !12, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!11 = !DIFile(filename: "/usr/aarch64-linux-gnu/include/stdio.h", directory: "")
!12 = !DISubroutineType(types: !13)
!13 = !{!7, !14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !16, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTS8_IO_FILE")
!16 = !DIFile(filename: "/usr/aarch64-linux-gnu/include/bits/libio.h", directory: "")
!17 = !{!18, !19, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !35, !36, !37, !38, !42, !44, !46, !50, !53, !55, !57, !58, !59, !60, !64, !65}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !16, line: 246, baseType: !7, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !15, file: !16, line: 251, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !15, file: !16, line: 252, baseType: !20, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !15, file: !16, line: 253, baseType: !20, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !15, file: !16, line: 254, baseType: !20, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !15, file: !16, line: 255, baseType: !20, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !15, file: !16, line: 256, baseType: !20, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !15, file: !16, line: 257, baseType: !20, size: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !15, file: !16, line: 258, baseType: !20, size: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !15, file: !16, line: 260, baseType: !20, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !15, file: !16, line: 261, baseType: !20, size: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !15, file: !16, line: 262, baseType: !20, size: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !15, file: !16, line: 264, baseType: !33, size: 64, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !16, line: 160, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !15, file: !16, line: 266, baseType: !14, size: 64, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !15, file: !16, line: 268, baseType: !7, size: 32, offset: 896)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !15, file: !16, line: 272, baseType: !7, size: 32, offset: 928)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !15, file: !16, line: 274, baseType: !39, size: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 140, baseType: !41)
!40 = !DIFile(filename: "/usr/aarch64-linux-gnu/include/bits/types.h", directory: "")
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !15, file: !16, line: 278, baseType: !43, size: 16, offset: 1024)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !15, file: !16, line: 279, baseType: !45, size: 8, offset: 1040)
!45 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !15, file: !16, line: 280, baseType: !47, size: 8, offset: 1048)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 1)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !15, file: !16, line: 284, baseType: !51, size: 64, offset: 1088)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !16, line: 154, baseType: null)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !16, line: 293, baseType: !54, size: 64, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 141, baseType: !41)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !15, file: !16, line: 301, baseType: !56, size: 64, offset: 1216)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !15, file: !16, line: 302, baseType: !56, size: 64, offset: 1280)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !15, file: !16, line: 303, baseType: !56, size: 64, offset: 1344)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !15, file: !16, line: 304, baseType: !56, size: 64, offset: 1408)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !15, file: !16, line: 306, baseType: !61, size: 64, offset: 1472)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.1/include/stddef.h", directory: "")
!63 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !15, file: !16, line: 307, baseType: !7, size: 32, offset: 1536)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !15, file: !16, line: 309, baseType: !66, size: 160, offset: 1568)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 20)
!69 = !DISubprogram(name: "m5_checkpoint", scope: !70, file: !70, line: 54, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!70 = !DIFile(filename: "src/../../../../gem5_bfs/include/gem5/m5ops.h", directory: "/home/fugelin/Work/Research/gem5/prefetch_project/sam_swpf/program/spmv")
!71 = !DISubroutineType(types: !72)
!72 = !{null, !63, !63}
!73 = !DISubprogram(name: "m5_reset_stats", scope: !70, file: !70, line: 55, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!74 = !DISubprogram(name: "m5_dump_stats", scope: !70, file: !70, line: 56, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!75 = !{!0, !76, !78, !80, !82, !93, !96, !98}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "row", scope: !2, file: !3, line: 21, type: !7, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "col", scope: !2, file: !3, line: 21, type: !7, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "nnz", scope: !2, file: !3, line: 21, type: !7, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "mat", scope: !2, file: !3, line: 51, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1280000000, elements: !91)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "COO", file: !3, line: 49, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 45, size: 128, flags: DIFlagTypePassByValue, elements: !87, identifier: "_ZTS3COO")
!87 = !{!88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !86, file: !3, line: 46, baseType: !7, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !86, file: !3, line: 47, baseType: !7, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !86, file: !3, line: 48, baseType: !9, size: 64, offset: 64)
!91 = !{!92}
!92 = !DISubrange(count: 10000000)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression(DW_OP_constu, 10000000, DW_OP_stack_value))
!94 = distinct !DIGlobalVariable(name: "max_nnz", scope: !2, file: !3, line: 11, type: !95, isLocal: true, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression(DW_OP_constu, 5000000, DW_OP_stack_value))
!97 = distinct !DIGlobalVariable(name: "max_row", scope: !2, file: !3, line: 9, type: !95, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression(DW_OP_constu, 5000000, DW_OP_stack_value))
!99 = distinct !DIGlobalVariable(name: "max_col", scope: !2, file: !3, line: 10, type: !95, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4194304, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 65536)
!103 = !{i32 7, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{i32 1, !"wchar_size", i32 4}
!106 = !{!"Ubuntu clang version 10.0.1-++20211003084855+ef32c611aa21-1~exp1~20211003085243.2"}
!107 = distinct !DISubprogram(name: "mul", linkageName: "_Z3mulPdS_S_PiS0_", scope: !3, file: !3, line: 53, type: !108, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !110)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !8, !8, !8, !6, !6}
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !120}
!111 = !DILocalVariable(name: "ret", arg: 1, scope: !107, file: !3, line: 53, type: !8)
!112 = !DILocalVariable(name: "vec", arg: 2, scope: !107, file: !3, line: 53, type: !8)
!113 = !DILocalVariable(name: "val", arg: 3, scope: !107, file: !3, line: 53, type: !8)
!114 = !DILocalVariable(name: "row_ptr", arg: 4, scope: !107, file: !3, line: 53, type: !6)
!115 = !DILocalVariable(name: "col_idx", arg: 5, scope: !107, file: !3, line: 53, type: !6)
!116 = !DILocalVariable(name: "last_row", scope: !107, file: !3, line: 55, type: !7)
!117 = !DILocalVariable(name: "this_row", scope: !107, file: !3, line: 55, type: !7)
!118 = !DILocalVariable(name: "i", scope: !119, file: !3, line: 57, type: !7)
!119 = distinct !DILexicalBlock(scope: !107, file: !3, line: 57, column: 9)
!120 = !DILocalVariable(name: "j", scope: !121, file: !3, line: 60, type: !7)
!121 = distinct !DILexicalBlock(scope: !122, file: !3, line: 60, column: 13)
!122 = distinct !DILexicalBlock(scope: !123, file: !3, line: 57, column: 39)
!123 = distinct !DILexicalBlock(scope: !119, file: !3, line: 57, column: 9)
!124 = !DILocation(line: 0, scope: !107)
!125 = !DILocation(line: 0, scope: !119)
!126 = !DILocation(line: 57, column: 29, scope: !123)
!127 = !{!128, !128, i64 0}
!128 = !{!"int", !129, i64 0}
!129 = !{!"omnipotent char", !130, i64 0}
!130 = !{!"Simple C++ TBAA"}
!131 = !DILocation(line: 57, column: 27, scope: !123)
!132 = !DILocation(line: 57, column: 9, scope: !119)
!133 = !DILocation(line: 58, column: 24, scope: !122)
!134 = !DILocation(line: 65, column: 1, scope: !107)
!135 = !DILocation(line: 59, column: 33, scope: !122)
!136 = !DILocation(line: 59, column: 24, scope: !122)
!137 = !DILocation(line: 0, scope: !121)
!138 = !DILocation(line: 60, column: 38, scope: !139)
!139 = distinct !DILexicalBlock(scope: !121, file: !3, line: 60, column: 13)
!140 = !DILocation(line: 60, column: 13, scope: !121)
!141 = distinct !{!141, !132, !142}
!142 = !DILocation(line: 64, column: 9, scope: !119)
!143 = !DILocation(line: 0, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !3, line: 60, column: 55)
!145 = !DILocation(line: 61, column: 24, scope: !144)
!146 = !{!147, !147, i64 0}
!147 = !{!"double", !129, i64 0}
!148 = !DILocation(line: 61, column: 27, scope: !144)
!149 = !DILocation(line: 61, column: 40, scope: !144)
